{
    "pageTitle": "دليل المستخدم",
    "backToApp": "العودة إلى التطبيق",
    "section": {
        "gettingStarted": {
            "title": "١. البدء: إنشاء حساب",
            "intro": "مرحبًا بك في مركز دعم نيكسوس! دورك يحدد كيفية التسجيل والتفاعل مع النظام.",
            "manager": {
                "title": "للمدراء: إنشاء شركة",
                "step1": "انتقل إلى صفحة التسجيل.",
                "step2": "اختر دور \"مدير\" من القائمة المنسدلة.",
                "step3": "اختر خطة اشتراك لشركتك. إذا اخترت خطة مدفوعة، سيتم تحويلك إلى PayPal لإتمام الاشتراك قبل إنشاء الحساب.",
                "step4": "أدخل اسم شركتك الجديدة (يجب أن يكون فريدًا). هذا الاسم مهم لأن فريقك سيستخدمه لتسجيل الدخول.",
                "step5": "أكمل بقية النموذج واضغط على الزر النهائي لإنشاء حساب الشركة."
            },
            "agentUser": {
                "title": "للوكلاء والمستخدمين: الانضمام إلى شركة",
                "step1": "انتقل إلى صفحة التسجيل.",
                "step2": "اختر دورك (\"وكيل\" أو \"مستخدم\").",
                "step3": "في حقل \"اسم الشركة الموجودة\"، أدخل الاسم الصحيح الذي قدمه لك المدير.",
                "step4": "أكمل النموذج واضغط على \"تسجيل\". ستصبح الآن جزءًا من فريق شركتك."
            }
        },
        "usingTheApp": {
            "title": "٢. استخدام التطبيق",
            "login": {
                "title": "تسجيل الدخول",
                "desc": "لتسجيل الدخول، ستحتاج دائمًا إلى ثلاث معلومات: بريدك الإلكتروني، كلمة المرور، واسم الشركة."
            },
            "user": {
                "title": "لوحة تحكم المستخدم",
                "desc": "كمستخدم، هدفك الرئيسي هو الحصول على المساعدة. اضغط على \"الحصول على مساعدة الذكاء الاصطناعي\" لبدء محادثة مع مساعدنا الذكي نيكسوس. صف مشكلتك وسيرشدك نيكسوس. إذا لم يتمكن من حل المشكلة، سيقترح عليك إنشاء تذكرة يمكنك إكمالها وإرسالها."
            },
            "agent": {
                "title": "لوحة تحكم الوكيل",
                "desc": "يمكن للوكلاء رؤية التذاكر غير المُسندة وتوليها. يمكنك أيضًا رؤية قائمة التذاكر المسندة إليك حاليًا. افتح أي تذكرة للتواصل مع المستخدم وحل مشكلته."
            },
            "manager": {
                "title": "لوحة تحكم المدير",
                "desc": "توفر لوحة تحكم المدير نظرة شاملة. يمكنك:",
                "feature1": "عرض جميع التذاكر في النظام بغض النظر عن من تم تعيينها له.",
                "feature2": "تعيين أو إعادة تعيين التذاكر للوكلاء المتاحين.",
                "feature3": "تصفية التذاكر لتحليل الاتجاهات والأداء.",
                "feature4": "إدارة المستخدمين: تحديث أدوارهم (مثلاً: ترقية مستخدم إلى وكيل) أو حذف المستخدمين.",
                "feature5": "تحديث اسم الشركة."
            }
        },
        "voice": {
            "title": "٣. الميزات الصوتية",
            "desc": "يتضمن التطبيق ميزات صوتية لتحسين تجربتك. يمكنك استخدام الميكروفون لإملاء الرسائل في الدردشة، ويمكن قراءة ردود الذكاء الاصطناعي بصوت عالٍ تلقائيًا. استخدم أيقونات مكبر الصوت والميكروفون للتحكم بهذه الميزات."
        }
    }
}